tutorials/swak4Foam/InterFoamWithSources/mixingThing/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-0.5 -0.5 -0.1)
    (0.5 -0.5 -0.1)
    (0.5 0.5 -0.1)
    (-0.5 0.5 -0.1)
    (-0.5 -0.5 0.1)
    (0.5 -0.5 0.1)
    (0.5 0.5 0.1)
    (-0.5 0.5 0.1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (50 50 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    wall top 
    (
        (3 7 6 2)
    )
    wall walls 
    (
        (0 4 7 3)
        (2 6 5 1)
        (1 5 4 0)
    )
    empty frontAndBack 
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
